Repository: massidea/site
Catalog: application/languages/industries.tmx
Source language: fi
Languages: en

source: Toimialat
en: Industries

source: Asuminen
en: Living business

source: Digisisältö
en: Digital content

source: Elintearvikekehitys
en: Food development

source: Energiateknologia
en: Energy technology

source: Hyvinvointi
en: Welfare

source: Jokapaikan tietotekniikka
en: Ubiquitous computing

source: Matkailu ja elämystuotanto
en: Tourism

source: Meri
en: Maritime

source: Nanoteknologia
en: Nanotechnology

source: Uusiutuva metsäteollisuus
en: Forest industry future

source: Ymäpäristöteknologia
en: Cleantech

source: Älykkäät koneet
en: Intelligent machines
